// L2.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>

void main(void)
{
	setlocale(LC_ALL, "Ukr");
	std::cout << "1. Паламурчук Антон Олегович\n";
	std::cout << "2. Дата народження: 19.02.1999\n";
	std::cout << "3. Знак зодіаку: Рак\n";
	std::cout << "4. Відомості про батьків:\n"
		<< "Мати – Паламурчук Галина Володимирівна\n"
		<< "Батько – Паламурчук Руслан Олегович\n";
	std::cout << "5. Освіта:\n"
		<< "У 2005 році пішов у 1 клас Житомирської середньої школи № 3 в рідному місті Житомир,\n"
		<< "а в 2015 році отримав неповну середню освіту і вступив до Житомирського економічного технікуму на спеціальність технік-технолог, який успішно закінчив у 2018 році.\n";
	std::cout << "6. Період військової служби: З 2018 по 2019 рік – служба в армії (десантні війська, старший сержант запасу).\n";
	std::cout << "7. Сімейний стан: Одружений. Дружина – Ілона Анатоліївна Карпюк, 1983 року народження,\n"
		<< " українка, освіта вища юридична, в даний час знаходиться в декретній відпустці.\n";
	std::cout << "8. Хобі: Біг на довгі дистанції.\n";
	std::cout << "9. Інформація про особисті відзнаки: Зайняв перше місце у конкурсі за відмінну влучність";
	std::cout << "10. Номер телефону: (098) 999-99-99\n";
	std::cout << "11: Судимість: не маю\n";
	std::cout << "12. Кількість іноземних мов: Англійська та Німецька\n";
	std::cout << "6. Сімейний стан: неодружений\n";
	std::cout << "7. Інформація про особисті досягнення, нагороди, заохочення: "
		<< "У трудовій діяльності завжди відрізнявся своїми досягненнями і творчою ініціативою.\n";
	std::cout << "8. Інформація про хобі: Спорт і велотуризм\n";
	std::cout << "9. Трудова діяльність: студент.\n";
	std::cout << "10: Досягнення: В 2016 та 2017 роках, приймав участь в міських, районних та обласних олімпіадах з геометрії та алгебри, "
		<< "на яких здобув призові місця, та здобув 4 місце на всеукраїнській олімпіаді з геометрії.\n";
	std::cout << "11: Громадська діяльність: "
		<< "Беру активну участь у громадсько- політичному житті міста й держави. Член Всеукраїнського товариства 'Просвіта' імені Тараса Шевченка.\n";
	std::cout << "Особисті якості: "
		<< "Спокійний, урівноважений, але свої погляди обстоюю активно й аргументовано, доброзичливий, комунікабельний, вмію аналізувати й логічно мислити, дисциплінований. Шкідливих звичок не маю.\n";
	std::cout << "12. Додаткові відомості: "
		<< "Володію двома іноземними мовами (німецькою, російською); вивчаю англійську мову. Рідна мова –українська.\n";
	std::cout << "13. Фактична домашня адреса: м.Вінниця вул.Ринкова, буд 7.\n";
	std::cout << "14. Номер телефону: (098) 000-00-00\n";
	std::cout << "10. Віросповідання: Православний християнин.\n";
	std::cout << "11. Паспортні дані: Паспортні дані: ЕА 536126,\n"
		<< "виданий Київським МВ УМВС 6 вересня 2015 року, реєстрація за адресою: Київська обл., м. Київ, вул. Шевченка, 19 кв. 4\n";
	std::cout << "12. Фактична домашня адреса: м.Вінниця вул.Ринкова, буд 7.\n";
	std::cout << "13. Номер телефону: (098) 999-99-99\n";
	std::cout << "14. Е-mail: antons90@gmail.com\n";
	std::cout << "15: Судимість: не маю\n";
	std::cout << "16: Досягнення: В 2016 та 2017 роках, приймав участь в міських, районних та обласних олімпіадах з геометрії та алгебри,"
		<< "на яких здобув призові місця, та здобув 4 місце на всеукраїнській олімпіаді з геометрії.\n";
}

// Run program: Ctrl + F5 or Debug > Start Without Debugging menu
// Debug program: F5 or Debug > Start Debugging menu

// Tips for Getting Started: 
//   1. Use the Solution Explorer window to add/manage files
//   2. Use the Team Explorer window to connect to source control
//   3. Use the Output window to see build output and other messages
//   4. Use the Error List window to view errors
//   5. Go to Project > Add New Item to create new code files, or Project > Add Existing Item to add existing code files to the project
//   6. In the future, to open this project again, go to File > Open > Project and select the .sln file
